rottenpotatoes/app/controllers/movies_controller.rb

  def with_same_director
    @movie = Movie.find params[:id]
---
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 1]]

  def update
    @movie = Movie.find params[:id]
    @movie.update_attributes!(movie_params)
---
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 3]]
UPDATE "movies" SET "title" = ?, "release_date" = ?, "updated_at" = ? WHERE "movies"."id" = ?  [["title", "My New Movie"], ["release_date", "1984-10-26 00:00:00.000000"], ["updated_at", "2015-12-03 23:09:20.266802"], ["id", 1]]